LEXICON: dict[str, str] = {
    'welcome_text': 'Привет, {}!\n\nКупить рекламу в канале, поделиться вакансией, задать вопрос админу и '
                    'предложить пост.\n\nЖмите - /menu',
    'menu': 'Что вас интересует? 🧐',
    'buy_advertising_btn': '💲 Купить рекламу в канале',
    'offer_vacancy_btn': '📄 Прислать вакансию',
    'offer_news_btn': '🖐 Предложить пост в канал',
    'mentor_btn': '❓ Узнать про менторство',
    'help': 'Привет! Это бот-помощник Лены из «Копилки текстов».\n\nОн умеет:\n\n'
            '— объяснять условия рекламы на канале;\n'
            '— принимать тексты вакансий и ваши находки для постов;\n'
            '— рассказывать о менторской программе админа.',
    'to_menu': 'В меню',
    'buy_advertising': '<b>Форматы и стоимость размещений</b>\n\n'
                       '🔹 1/24 (1 час в топе, 24 часа в ленте) — 3 000₽\n'
                       '🔹 2/48 — 4 000₽ \n'
                       '🔹 4/72 — 5 000₽ \n\n'
                       'Нативный пост от админа канала + 1 500₽ к стоимости.\n\n'
                       '📍2 рекламных поста с нуля (не нативные) — 6 000₽\n\n'
                       'Я могу написать для вас рекламные посты с нуля — если у вас нет готовых. В отличие '
                       'от нативных публикаций, эти тексты вы сможете использовать и в рекламе «Копилки», и '
                       'в других телеграм-каналах.\n\n'
                       '<b>Свободные даты</b>:\n'
                       'https://clck.ru/34BjoL\n\n'
                       '<b>Как купить рекламу</b>:\n'
                       'Выберите свободную дату публикации → свяжитесь с @lena_solodkova → оплатите заказ. '
                       'Дату бронирую сразу после оплаты.\n\n'
                       'Также я открыта к взаимному пиару — подробности готова обсуждать в личке 🤝',
    'offer_vacancy': 'В «Копилке текстов» вы можете <b>бесплатно разместить вакансию</b>, которая актуальна'
                     ' подписчикам — копирайтерам, редакторам, журналистам, UX-редакторам.\n\n'
                     'Вот как они распределены в процентом соотношении: t.me/smotri_kakoi_text/125\n\n'
                     '<b>Пришлите в ответном сообщении текст вакансии</b> 👇🏻\n'
                     'Обязательно укажите ключевые задачи, формат работы (удалёнка или офис) и оплаты '
                     '(примерная вилка, оформление по ТК, ГПХ или фриланс).',
    'offer_vacancy_warning': 'То, что вы отправили не похоже на текст вакансии\n\n'
                             'Пожалуйста, введите текст вакансии в соответствии в описанием.\n'
                             'Для отмены нажмите - /cancel',
    'offer_vacancy_answer': 'Спасибо! В течение двух дней я приду к вам в '
                            'личку за уточнениями и согласованием даты публикации',
    'offer_news': 'Поделитесь своей находкой с подписчиками канала. Пришлите скрин или фото со своим'
                  ' комментарием в одном сообщении 👇🏻',
    'offer_news_warning': 'То, что вы отправили не похоже на новость\n\n'
                          'Пожалуйста, отправьте сообщение в соответствии в описанием\n'
                          'Для отмены нажмите - /cancel',
    'offer_news_answer': 'Спасибо за такую находку!',
    'mentor': 'На связи админ «Копилки» Лена. Я открыла личное менторство — для тех, кому нужен новый'
              ' рывок в работе с текстами.\n\n'
              'Помогу:\n\n'
              '🔹<b>найти свои сильные и слабые стороны</b> в работе с текстами, чтобы понять, какие можно '
              'улучшить, а какие сделать своим козырем;\n'
              '🔹<b>пополнить портфолио крутыми проектами</b>;\n'
              '🔹<b>найти новые варианты работы</b> (оформим портфолио, резюме, постучимся в разные вакансии);\n'
              '🔹<b>развить авторский стиль</b> для личного блога.\n\n'
              'Нас ждут онлайн-встречи с обсуждением планов и обсуждения в чате. Активно работать будем месяц — '
              'планы и цели построим согласно этому «графику»\n\n'
              'По итогу вы построите эффективные планы по апгрейду своей карьеры и уже начнёте их воплощать.\n\n'
              '<b>Длительность активного менторства</b>: 1 месяц. Но на связи останемся и после.\n'
              '<b>Стоимость</b>:  <span class="tg-spoiler">10 000 рублей</span>.\n\n'
              'Пишите: @lena_solodkova',
    'no_command_text': 'Извините, я не понял команды.\n\nДля перехода в меню нажмите - /menu'
}
